---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalColumnHorizontalProjectionPlane
source: html/04bdd6c8-269e-32ef-e849-a452a5a161c1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalColumnHorizontalProjectionPlane Property

"Horizontal Projection"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAnalyticalColumnHorizontalProjectionPlane { get; }
```